{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Part D"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'3.7.4 (default, Oct 15 2019, 22:29:14) \\n[GCC 7.4.0]'"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import sys\n",
    "import random\n",
    "from pprint import pprint as pp\n",
    "random.seed(42)\n",
    "sys.version"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.7.6\n",
      "4.3.0\n"
     ]
    }
   ],
   "source": [
    "import neo4j\n",
    "import py2neo\n",
    "print(neo4j.__version__)\n",
    "print(py2neo.__version__)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher\n",
    "# https://ipython-cypher.readthedocs.io/en/latest/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from py2neo import Graph\n",
    "\n",
    "# instantiate drivers\n",
    "NEO4J_URI=\"bolt://localhost:7687\"\n",
    "gdb = GraphDatabase.driver(uri=NEO4J_URI, auth=None)\n",
    "graph = Graph(NEO4J_URI)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'name': 'algo.allShortestPaths.stream',\n",
       " 'description': \"CALL algo.allShortestPaths.stream(weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', defaultValue:1.0, concurrency:4}) YIELD sourceNodeId, targetNodeId, distance - yields a stream of {sourceNodeId, targetNodeId, distance}\",\n",
       " 'signature': 'algo.allShortestPaths.stream(propertyName :: STRING?, config = {} :: MAP?) :: (sourceNodeId :: INTEGER?, targetNodeId :: INTEGER?, distance :: FLOAT?)',\n",
       " 'type': 'procedure'}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"CALL algo.list();\").data()[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Define research communities"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The first thing to do is to find/define the research communities. A community is\n",
    "defined by a set of keywords. Assume that the database community is defined through\n",
    "the following keywords: \n",
    "\n",
    "> data management, indexing, data modeling, big data, data\n",
    "processing, data storage and data querying."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Since we don't have these keywords in the database, we will have to create them"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [],
   "source": [
    "dbms_kw = ['data management',\n",
    "     'indexing',\n",
    "     'data modeling',\n",
    "     'big data',\n",
    "     'data processing',\n",
    "     'data storage',\n",
    "     'data querying']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>count(kw)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[0]]"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (kw:Keyword)\n",
    "    WHERE kw.name in ['data management',\n",
    "     'indexing',\n",
    "     'data modeling',\n",
    "     'big data',\n",
    "     'data processing',\n",
    "     'data storage',\n",
    "     'data querying']\n",
    "DETACH DELETE kw\n",
    "RETURN count(kw)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7 nodes created.\n",
      "14 properties set.\n",
      "7 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>kw</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data management&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;indexing&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data modeling&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;big data&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data processing&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data storage&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data querying&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'data management', 'fake': True}],\n",
       " [{'name': 'indexing', 'fake': True}],\n",
       " [{'name': 'data modeling', 'fake': True}],\n",
       " [{'name': 'big data', 'fake': True}],\n",
       " [{'name': 'data processing', 'fake': True}],\n",
       " [{'name': 'data storage', 'fake': True}],\n",
       " [{'name': 'data querying', 'fake': True}]]"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "UNWIND ['data management',\n",
    "     'indexing',\n",
    "     'data modeling',\n",
    "     'big data',\n",
    "     'data processing',\n",
    "     'data storage',\n",
    "     'data querying'] as dbkw\n",
    "MERGE (kw:Keyword {name: dbkw, fake: true})\n",
    "RETURN kw"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Assign papers to these keywords randomly"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a.id': '8fb9c95bf34a0f28dc05819cb4aada0cb94fe555'},\n",
       " {'a.id': '5cfdb256b6ae968374469bd36702ed341cfe9485'},\n",
       " {'a.id': '0fbe46932967ec0db80b18e70fa199fb652313ea'},\n",
       " {'a.id': 'c4062742b4e0d13cfa0e992fdf2cebf2eb71c415'},\n",
       " {'a.id': 'f218ce53248d756db61726985f73e6e8c109b3e2'}]"
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "article_ids = graph.run(\"MATCH (a:Article) RETURN a.id\").data()\n",
    "article_ids[:5]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [],
   "source": [
    "for aid in article_ids:\n",
    "    for kw in random.sample(dbms_kw, random.randint(0, len(dbms_kw))):\n",
    "        graph.run(\n",
    "            \"\"\"MATCH (a:Article), (kw:Keyword)\n",
    "            WHERE a.id = $aid AND kw.name = $kwname\n",
    "            MERGE (a)-[:CONTAINS]->(kw)\n",
    "            ON CREATE SET kw.name = $kwname, kw.fake = true\n",
    "            ON MATCH SET kw.name = $kwname, kw.fake = true\"\"\",\n",
    "            aid = aid[\"a.id\"],\n",
    "            kwname = kw\n",
    "        )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Next, we need to find the conferences and journals related to the database community\n",
    "(i.e., are specific to the field of databases). Assume that if 90% of the papers published\n",
    "in a conference/journal contain one of the keywords of the database community we\n",
    "consider that conference/journal as related to that community."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create a research community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "constraints_added: 0\n",
       "constraints_removed: 0\n",
       "contained_updates: True\n",
       "indexes_added: 0\n",
       "indexes_removed: 0\n",
       "labels_added: 0\n",
       "labels_removed: 0\n",
       "nodes_created: 0\n",
       "nodes_deleted: 1\n",
       "properties_set: 0\n",
       "relationships_created: 0\n",
       "relationships_deleted: 182"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"MATCH (rc:ResearchCommunity) DETACH DELETE rc\").stats()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "constraints_added: 0\n",
       "constraints_removed: 0\n",
       "contained_updates: True\n",
       "indexes_added: 0\n",
       "indexes_removed: 0\n",
       "labels_added: 1\n",
       "labels_removed: 0\n",
       "nodes_created: 1\n",
       "nodes_deleted: 0\n",
       "properties_set: 2\n",
       "relationships_created: 0\n",
       "relationships_deleted: 0"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"MERGE (rc:ResearchCommunity {name: 'databases', fake: true}) RETURN rc\").stats()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>kw</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data querying&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;indexing&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data management&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data modeling&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;big data&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data processing&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;data storage&#x27;, &#x27;fake&#x27;: True}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'data querying', 'fake': True}],\n",
       " [{'name': 'indexing', 'fake': True}],\n",
       " [{'name': 'data management', 'fake': True}],\n",
       " [{'name': 'data modeling', 'fake': True}],\n",
       " [{'name': 'big data', 'fake': True}],\n",
       " [{'name': 'data processing', 'fake': True}],\n",
       " [{'name': 'data storage', 'fake': True}]]"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (kw:Keyword)\n",
    "WHERE kw.name IN ['data management',\n",
    "     'indexing',\n",
    "     'data modeling',\n",
    "     'big data',\n",
    "     'data processing',\n",
    "     'data storage',\n",
    "     'data querying']\n",
    "return kw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;data querying&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;indexing&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;data management&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;data modeling&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;big data&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;data processing&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}, {}, {&#x27;name&#x27;: &#x27;data storage&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'data querying', 'fake': True}]],\n",
       " [[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'indexing', 'fake': True}]],\n",
       " [[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'data management', 'fake': True}]],\n",
       " [[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'data modeling', 'fake': True}]],\n",
       " [[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'big data', 'fake': True}]],\n",
       " [[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'data processing', 'fake': True}]],\n",
       " [[{'name': 'databases', 'fake': True},\n",
       "   {},\n",
       "   {'name': 'data storage', 'fake': True}]]]"
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (kw:Keyword)\n",
    "WHERE kw.name IN ['data management',\n",
    "     'indexing',\n",
    "     'data modeling',\n",
    "     'big data',\n",
    "     'data processing',\n",
    "     'data storage',\n",
    "     'data querying']\n",
    "WITH kw\n",
    "MATCH (rc:ResearchCommunity)\n",
    "WHERE rc.name = \"databases\"\n",
    "MERGE p=(rc)-[r:CONTAINS]->(kw)\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "get the count of all the articles published in a journal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>publication_name</th>\n",
       "        <th>publication_type</th>\n",
       "        <th>total_articles</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dr. Gregory Arnold</td>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lance Rose</td>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>90</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stephanie Hoffman</td>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Laurie Carter</td>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rebecca Lane</td>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>79</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Dr. Gregory Arnold', ['Conference'], 93],\n",
       " ['Lance Rose', ['Conference'], 90],\n",
       " ['Stephanie Hoffman', ['Conference'], 85],\n",
       " ['Laurie Carter', ['Conference'], 80],\n",
       " ['Rebecca Lane', ['Conference'], 79]]"
      ]
     },
     "execution_count": 92,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (a:Article)-[:PUBLISHED_IN]->(instance)-[:OF]->(publication)\n",
    "WHERE (publication:Journal OR publication:Conference) AND (instance:Volume OR instance:Edition)\n",
    "RETURN publication.name AS publication_name, LABELS(publication) AS publication_type, COUNT(a) AS total_articles\n",
    "ORDER BY total_articles DESC\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>publication_type</th>\n",
       "        <th>publication_name</th>\n",
       "        <th>related_articles</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>Heather Allen</td>\n",
       "        <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>William Mcmillan</td>\n",
       "        <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>Richard Harper</td>\n",
       "        <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>Jason Bell</td>\n",
       "        <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Conference&#x27;]</td>\n",
       "        <td>Mckenzie Green</td>\n",
       "        <td>20</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Conference'], 'Heather Allen', 22],\n",
       " [['Conference'], 'William Mcmillan', 22],\n",
       " [['Conference'], 'Richard Harper', 21],\n",
       " [['Conference'], 'Jason Bell', 20],\n",
       " [['Conference'], 'Mckenzie Green', 20]]"
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (:ResearchCommunity {name: 'databases'})-[:CONTAINS]->(:Keyword)<-[:CONTAINS]-(article:Article)-[:PUBLISHED_IN]->(instance)-[:OF]->(publication)\n",
    "WHERE (publication:Journal OR publication:Conference) AND (instance:Volume OR instance:Edition)\n",
    "WITH publication, COUNT(DISTINCT article) AS related_articles\n",
    "RETURN \n",
    "    LABELS(publication) AS publication_type, \n",
    "    publication.name AS publication_name,\n",
    "    related_articles\n",
    "ORDER BY related_articles DESC\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We join both queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (<ipython-input-94-2e137eef1989>, line 1)",
     "output_type": "error",
     "traceback": [
      "\u001b[0;36m  File \u001b[0;32m\"<ipython-input-94-2e137eef1989>\"\u001b[0;36m, line \u001b[0;32m1\u001b[0m\n\u001b[0;31m    MATCH (p:paper) -[:published_in]-> (v) -[:of]-> (j)\u001b[0m\n\u001b[0m            ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"
     ]
    }
   ],
   "source": [
    "MATCH (p:paper) -[:published_in]-> (v) -[:of]-> (j)\n",
    "WHERE (v:volume or v:edition) and (j:journal or j:conference)\n",
    "WITH j, count(p) as total_papers\n",
    "MATCH (:community {name: 'database'})<-[:composes]-(:keyword) <-[:related_to]- (p:paper) -[:published_in]-> (v) -[:of]-> (j)\n",
    "WHERE (v:volume or v:edition) and (j:journal or j:conference)\n",
    "WITH j, total_papers, count(distinct p) as related_papers\n",
    "WHERE toFloat(related_papers) / toFloat(total_papers) >= 0.9\n",
    "MATCH (c:community {name:'database'})\n",
    "CREATE (j) -[:related_to]-> (c)\n",
    "RETURN j;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>publication</th>\n",
       "        <th>related_articles</th>\n",
       "        <th>total_articles</th>\n",
       "        <th>is_relevant_for_community</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;review_policy_min_count&#x27;: 3, &#x27;name&#x27;: &#x27;Dr. Gregory Arnold&#x27;, &#x27;id&#x27;: 80}</td>\n",
       "        <td>5</td>\n",
       "        <td>42</td>\n",
       "        <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;review_policy_min_count&#x27;: 3, &#x27;name&#x27;: &#x27;Christopher Patterson&#x27;, &#x27;id&#x27;: 26}</td>\n",
       "        <td>5</td>\n",
       "        <td>42</td>\n",
       "        <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;review_policy_min_count&#x27;: 3, &#x27;name&#x27;: &#x27;Barbara Flores&#x27;, &#x27;id&#x27;: 96}</td>\n",
       "        <td>5</td>\n",
       "        <td>42</td>\n",
       "        <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;review_policy_min_count&#x27;: 3, &#x27;name&#x27;: &#x27;Steven Shaw&#x27;, &#x27;id&#x27;: 22}</td>\n",
       "        <td>5</td>\n",
       "        <td>42</td>\n",
       "        <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;review_policy_min_count&#x27;: 3, &#x27;name&#x27;: &#x27;Kelly Hubbard&#x27;, &#x27;id&#x27;: 25}</td>\n",
       "        <td>5</td>\n",
       "        <td>42</td>\n",
       "        <td>False</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'review_policy_min_count': 3, 'name': 'Dr. Gregory Arnold', 'id': 80},\n",
       "  5,\n",
       "  42,\n",
       "  False],\n",
       " [{'review_policy_min_count': 3, 'name': 'Christopher Patterson', 'id': 26},\n",
       "  5,\n",
       "  42,\n",
       "  False],\n",
       " [{'review_policy_min_count': 3, 'name': 'Barbara Flores', 'id': 96},\n",
       "  5,\n",
       "  42,\n",
       "  False],\n",
       " [{'review_policy_min_count': 3, 'name': 'Steven Shaw', 'id': 22},\n",
       "  5,\n",
       "  42,\n",
       "  False],\n",
       " [{'review_policy_min_count': 3, 'name': 'Kelly Hubbard', 'id': 25},\n",
       "  5,\n",
       "  42,\n",
       "  False]]"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (article:Article)-[:PUBLISHED_IN]->(instance)-[:OF]->(publication)\n",
    "WHERE (publication:Journal OR publication:Conference) AND (instance:Volume OR instance:Edition)\n",
    "WITH instance, count(article) AS total_articles\n",
    "MATCH (:ResearchCommunity {name: 'databases'})-[:CONTAINS]->(:Keyword)<-[:CONTAINS]-(article:Article)-[:PUBLISHED_IN]->(instance)-[:OF]->(publication)\n",
    "WHERE (publication:Journal OR publication:Conference) AND (instance:Volume or instance:Edition)\n",
    "WITH publication, total_articles, COUNT(DISTINCT article) as related_articles\n",
    "RETURN publication, related_articles, total_articles, toFloat(related_articles)/toFloat(total_articles) >= 0.9 AS is_relevant_for_community\n",
    "ORDER BY total_articles DESC\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "180 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (article:Article)-[:PUBLISHED_IN]->(instance)-[:OF]->(publication)\n",
    "WHERE (publication:Journal OR publication:Conference) AND (instance:Volume OR instance:Edition)\n",
    "\n",
    "WITH instance, count(article) AS total_articles\n",
    "MATCH (:ResearchCommunity {name: 'databases'})-[:CONTAINS]->(:Keyword)<-[:CONTAINS]-(article:Article)-[:PUBLISHED_IN]->(instance)-[:OF]->(publication)\n",
    "WHERE (publication:Journal OR publication:Conference) AND (instance:Volume or instance:Edition)\n",
    "\n",
    "WITH publication, total_articles, COUNT(DISTINCT article) as related_articles\n",
    "WHERE toFloat(related_articles)/toFloat(total_articles) >= 0.9\n",
    "\n",
    "MATCH (rc:ResearchCommunity {name: 'databases'})\n",
    "MERGE p=(publication)-[:RELEVANT_TO]->(rc)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Next, we want to identify the top papers of these conferences/journals. We need to\n",
    "find the papers with the highest page rank provided the number of citations from the\n",
    "papers of the same community (papers in the conferences/journals of the database\n",
    "community). As a result we would obtain (highlight), say, the top-100 papers of the\n",
    "conferences of the database community.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>a.title</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>&quot;Bump&quot;:  using a mobile app to enhance learning in simulation scenarios.</td>\n",
       "        <td>1.3380366005469115</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Linear Hypopigmentation After Triamcinolone Injection: A Rare Complication of a Common Procedure</td>\n",
       "        <td>1.2711560409981755</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Oleanolic acid suppresses the proliferation of lung carcinoma cells by miR-122/Cyclin G1/MEF2D axis</td>\n",
       "        <td>1.2702508100308478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Acetic acid as a sclerosing agent for renal cysts: Comparison with ethanol in follow-up results</td>\n",
       "        <td>1.2594134361017493</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Restoration of blue scratches in digital image sequences</td>\n",
       "        <td>1.2585701291449365</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['\"Bump\":  using a mobile app to enhance learning in simulation scenarios.',\n",
       "  1.3380366005469115],\n",
       " ['Linear Hypopigmentation After Triamcinolone Injection: A Rare Complication of a Common Procedure',\n",
       "  1.2711560409981755],\n",
       " ['Oleanolic acid suppresses the proliferation of lung carcinoma cells by miR-122/Cyclin G1/MEF2D axis',\n",
       "  1.2702508100308478],\n",
       " ['Acetic acid as a sclerosing agent for renal cysts: Comparison with ethanol in follow-up results',\n",
       "  1.2594134361017493],\n",
       " ['Restoration of blue scratches in digital image sequences',\n",
       "  1.2585701291449365]]"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "CALL algo.pageRank.stream(\n",
    "    'MATCH (c:ResearchCommunity {name: \"databases\"})<-[:RELEVANT_TO]-(publication)<-[:OF]-(instance)<-[:PUBLISHED_IN]-(article:Article) WHERE (instance:Volume OR instance:Edition) AND (publication:Journal OR publication:Conference) RETURN article',\n",
    "    'CITED_BY', {iterations:20, dampingFactor:0.85})\n",
    "YIELD nodeId, score\n",
    "MATCH (a:Article) WHERE ID(a) = nodeId\n",
    "WITH a, score\n",
    "ORDER by score DESC\n",
    "RETURN a.title, score\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1097/SIH.0b013e31825e8bcf&#x27;, &#x27;year&#x27;: 2012, &#x27;id&#x27;: &#x27;c104539460e4e4eac8b630ac81ef04d45a683286&#x27;, &#x27;title&#x27;: &#x27;&quot;Bump&quot;:  using a mobile app to enhance learning in simulation scenarios.&#x27;, &#x27;doi&#x27;: &#x27;10.1097/SIH.0b013e31825e8bcf&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.3380366005469115</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s00266-005-0131-z&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;6d246d9ffb02ada8a3e3b4dc11cd14bd36468290&#x27;, &#x27;title&#x27;: &#x27;Linear Hypopigmentation After Triamcinolone Injection: A Rare Complication of a Common Procedure&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s00266-005-0131-z&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.2711560409981755</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s11010-014-2228-7&#x27;, &#x27;year&#x27;: 2014, &#x27;id&#x27;: &#x27;665c0f7c26ba4c5b99fea43ac85509200a76dfe8&#x27;, &#x27;title&#x27;: &#x27;Oleanolic acid suppresses the proliferation of lung carcinoma cells by miR-122/Cyclin G1/MEF2D axis&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s11010-014-2228-7&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.2702508100308478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s002700010039&#x27;, &#x27;year&#x27;: 2000, &#x27;id&#x27;: &#x27;7f332daa1c7f6556c2094af68c512fa532349ec1&#x27;, &#x27;title&#x27;: &#x27;Acetic acid as a sclerosing agent for renal cysts: Comparison with ethanol in follow-up results&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s002700010039&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.2594134361017493</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.imavis.2006.04.013&#x27;, &#x27;year&#x27;: 2008, &#x27;id&#x27;: &#x27;4a2a536bc9ed1d032a41a6c0507cfc0dd714bab6&#x27;, &#x27;title&#x27;: &#x27;Restoration of blue scratches in digital image sequences&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.imavis.2006.04.013&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.2585701291449365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/ICASSP.2007.366746&#x27;, &#x27;year&#x27;: 2007, &#x27;id&#x27;: &#x27;a17699a73ac3c6dc8bcec10ecc420857d88eb632&#x27;, &#x27;title&#x27;: &#x27;Signal Processing Model and Receiver Algorithms for a Higher Rate Multi-User TR-UWB System&#x27;, &#x27;doi&#x27;: &#x27;10.1109/ICASSP.2007.366746&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.230960787693039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1111/idh.12112&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;7ec7fd995b8d81c5ccf58806569391efb520a5d2&#x27;, &#x27;title&#x27;: &#x27;Efficacy of dental floss impregnated with chlorhexidine on reduction of supragingival biofilm: a randomized controlled trial.&#x27;, &#x27;doi&#x27;: &#x27;10.1111/idh.12112&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.2180380919948224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1021/acsami.7b00092&#x27;, &#x27;year&#x27;: 2017, &#x27;id&#x27;: &#x27;a2dc6402747f633f5e25c4e37b9debe5efe0dc26&#x27;, &#x27;title&#x27;: &#x27;Enabling Inkjet Printed Graphene for Ion Selective Electrodes with Postprint Thermal Annealing.&#x27;, &#x27;doi&#x27;: &#x27;10.1021/acsami.7b00092&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.212353684892878</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.engappai.2008.04.018&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;2c86deb0e77a7fb9853472ec39749d209adb9440&#x27;, &#x27;title&#x27;: &#x27;Automatic semantic indexing of medical images using a web ontology language for case-based image retrieval&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.engappai.2008.04.018&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1766117617487908</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1159/000470896&#x27;, &#x27;year&#x27;: 2017, &#x27;id&#x27;: &#x27;65d67e1d3f74b749dfdaa8debf902e337c92dbd0&#x27;, &#x27;title&#x27;: &#x27;Use of an Osteoblast Overload Damage Model to Probe the Effect of Icariin on the Proliferation, Differentiation and Mineralization of MC3T3-E1 Cells through the Wnt/β-Catenin Signalling Pathway.&#x27;, &#x27;doi&#x27;: &#x27;10.1159/000470896&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1721596704795958</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.4049/jimmunol.1102845&#x27;, &#x27;year&#x27;: 2012, &#x27;id&#x27;: &#x27;1799f8fd782a5028eeccbed2daa6959b08b66308&#x27;, &#x27;title&#x27;: &#x27;Leishmania donovani exploits host deubiquitinating enzyme A20, a negative regulator of TLR signaling, to subvert host immune response.&#x27;, &#x27;doi&#x27;: &#x27;10.4049/jimmunol.1102845&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1610586579889057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1111/j.1532-849X.2008.00372.x&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;d6b5d08c93118db6aec30331af5ae7c65da003c1&#x27;, &#x27;title&#x27;: &#x27;Influence of investment, disinfection, and storage on the microhardness of ocular resins.&#x27;, &#x27;doi&#x27;: &#x27;10.1111/j.1532-849X.2008.00372.x&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1533227710518983</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/TE.2015.2498120&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;8184f36abc1eec1d031fc897454808c48b0963c7&#x27;, &#x27;title&#x27;: &#x27;Virtual Laboratory for QoS Study in Next-Generation Networks With Metro Ethernet Access&#x27;, &#x27;doi&#x27;: &#x27;10.1109/TE.2015.2498120&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1472146431449803</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1097/PAS.0b013e318212ae22&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;b8be59215c7f983bd1e3fbfc65e441c3ac2c618d&#x27;, &#x27;title&#x27;: &#x27;The anterior gradient homolog 3 (AGR3) gene is associated with differentiation and survival in ovarian cancer.&#x27;, &#x27;doi&#x27;: &#x27;10.1097/PAS.0b013e318212ae22&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1311789225321265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1186/1471-2377-9-47&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;0d890bec1cf9adedbe8683e0f7b7ec208cb35ed3&#x27;, &#x27;title&#x27;: &quot;Quality of Life as an outcome in Alzheimer&#x27;s disease and other dementias- obstacles and goals&quot;, &#x27;doi&#x27;: &#x27;10.1186/1471-2377-9-47&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1242389115970581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1021/acsami.7b05583&#x27;, &#x27;year&#x27;: 2017, &#x27;id&#x27;: &#x27;b67f04742496fb29ebc02de237b6fa039efcae4b&#x27;, &#x27;title&#x27;: &#x27;Cu2+-Loaded Polydopamine Nanoparticles for Magnetic Resonance Imaging-Guided pH- and Near-Infrared-Light-Stimulated Thermochemotherapy.&#x27;, &#x27;doi&#x27;: &#x27;10.1021/acsami.7b05583&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1143295769114046</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1128/JVI.02450-10&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;40ee9c895397af6326cbcf97f6448c8419940074&#x27;, &#x27;title&#x27;: &#x27;Shared ancestry between a newfound mole-borne hantavirus and hantaviruses harbored by cricetid rodents.&#x27;, &#x27;doi&#x27;: &#x27;10.1128/JVI.02450-10&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1130660441704099</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1093/humrep/dep288&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;25aa00f2fd8ca7dfbafb35d6d88fc3189e649c2f&#x27;, &#x27;title&#x27;: &#x27;Effects of the levonorgestrel-releasing intrauterine system on cell proliferation, Fas expression and steroid receptors in endometriosis lesions and normal endometrium.&#x27;, &#x27;doi&#x27;: &#x27;10.1093/humrep/dep288&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1088391794823111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1504/IJMIC.2015.069946&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;47813eb5d731387ec5e17ead82fdc03ce18992b3&#x27;, &#x27;title&#x27;: &#x27;Sliding mode control of a hydraulic servo system position using adaptive sliding surface and adaptive gain&#x27;, &#x27;doi&#x27;: &#x27;10.1504/IJMIC.2015.069946&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.1021982037927953</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.ultsonch.2012.12.003&#x27;, &#x27;year&#x27;: 2013, &#x27;id&#x27;: &#x27;2e277347fdc70287c56a4276d9d2e69055e3ecc8&#x27;, &#x27;title&#x27;: &#x27;Removal of pharmaceuticals from wastewater by biological processes, hydrodynamic cavitation and UV treatment.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.ultsonch.2012.12.003&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0946752542629836</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s10107-009-0289-2&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;00a234d1634e2335778b40aeacf0482ad5e2d70f&#x27;, &#x27;title&#x27;: &#x27;A Partition-Based Relaxation For Steiner Trees&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s10107-009-0289-2&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0919139780569822</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.2316/Journal.201.2005.2.201-1420&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;a09c196f66e8b5f44a7b734862a2a00e66d079a5&#x27;, &#x27;title&#x27;: &#x27;Modelling, Identification, and Compensation of Complex Hysteretic and log(t)-Type Creep Nonlinearities&#x27;, &#x27;doi&#x27;: &#x27;10.2316/Journal.201.2005.2.201-1420&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0858077373821289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.jphotobiol.2013.02.013&#x27;, &#x27;year&#x27;: 2013, &#x27;id&#x27;: &#x27;b67957a448829ca529abdabd1d300f25aa3272c2&#x27;, &#x27;title&#x27;: &#x27;Targeted in vitro photodynamic therapy via aptamer-labeled, porphyrin-loaded virus capsids.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.jphotobiol.2013.02.013&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0850889932829886</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1093/hmg/ddv308&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;0e341266be3de53a748234164d7bca164b2b6862&#x27;, &#x27;title&#x27;: &#x27;Loss of fibulin-4 disrupts collagen synthesis and maturation: implications for pathology resulting from EFEMP2 mutations.&#x27;, &#x27;doi&#x27;: &#x27;10.1093/hmg/ddv308&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0815894586499781</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/TIFS.2015.2512533&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;c5530c42f7783edbf44854de2b5f1c82b6c28bf7&#x27;, &#x27;title&#x27;: &#x27;Hierarchical and Shared Access Control&#x27;, &#x27;doi&#x27;: &#x27;10.1109/TIFS.2015.2512533&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0774257703218608</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1021/acsami.5b05150&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;a15e904d4c44b9d2e7fc733307664a5faa5f7a93&#x27;, &#x27;title&#x27;: &#x27;Conjugated Polymer-Based Hybrid Nanoparticles with Two-Photon Excitation and Near-Infrared Emission Features for Fluorescence Bioimaging within the Biological Window.&#x27;, &#x27;doi&#x27;: &#x27;10.1021/acsami.5b05150&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0754604017827656</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1038/sj.cdd.4401146&#x27;, &#x27;year&#x27;: 2003, &#x27;id&#x27;: &#x27;75f51d9d39ce66aad6fd5e6ab7147bad3b1e0db7&#x27;, &#x27;title&#x27;: &#x27;Mapping the initial DNA breaks in apoptotic Jurkat cells using ligation-mediated PCR&#x27;, &#x27;doi&#x27;: &#x27;10.1038/sj.cdd.4401146&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.073032755590975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1006/jpdc.1997.1351&#x27;, &#x27;year&#x27;: 1997, &#x27;id&#x27;: &#x27;7a69f0020f6131fb0fd82d7ae3c30300c694c8b4&#x27;, &#x27;title&#x27;: &#x27;Fast Runtime Block Cyclic Data Redistribution on Multiprocessors&#x27;, &#x27;doi&#x27;: &#x27;10.1006/jpdc.1997.1351&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0729917308548464</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/COMPSAC.2009.168&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;620f551944ec63cd5b8559c572c40b29205dc06a&#x27;, &#x27;title&#x27;: &#x27;Penetration Testing for Spam Filters&#x27;, &#x27;doi&#x27;: &#x27;10.1109/COMPSAC.2009.168&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.072659146180376</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1111/1742-6723.12535&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;bfea5a8c0ed0bc15ff8365e39c8035f7eb7f50d3&#x27;, &#x27;title&#x27;: &#x27;Identifying the risk of compassion fatigue, improving compassion satisfaction and building resilience in emergency medicine.&#x27;, &#x27;doi&#x27;: &#x27;10.1111/1742-6723.12535&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0702580779790878</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1142/S0219525913500367&#x27;, &#x27;year&#x27;: 2013, &#x27;id&#x27;: &#x27;82e8de5c4be2aa76e670e17e21db73edbb3d5a56&#x27;, &#x27;title&#x27;: &#x27;Evolution of Cooperation in the Snowdrift Game with Heterogeneous Population&#x27;, &#x27;doi&#x27;: &#x27;10.1142/S0219525913500367&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0675442358944565</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1128/JVI.02744-14&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;d5535a9cf734f134dda26619a3ac09025463f90f&#x27;, &#x27;title&#x27;: &#x27;Interferon-induced Ifit proteins: their role in viral pathogenesis.&#x27;, &#x27;doi&#x27;: &#x27;10.1128/JVI.02744-14&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0610442282864823</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1089/sur.2016.107&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;acaa12d900e5a682f399162091845f8ad47a03f4&#x27;, &#x27;title&#x27;: &#x27;Topical Antimicrobials and the Open Surgical Wound.&#x27;, &#x27;doi&#x27;: &#x27;10.1089/sur.2016.107&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0603097989456731</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1038/nature09256&#x27;, &#x27;year&#x27;: 2010, &#x27;id&#x27;: &#x27;35e72f5eafce5d0a8853add98956d5ec2f58d9f4&#x27;, &#x27;title&#x27;: &#x27;Quantum entanglement between an optical photon and a solid-state spin qubit&#x27;, &#x27;doi&#x27;: &#x27;10.1038/nature09256&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0598974862368775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1021/nn901476m&#x27;, &#x27;year&#x27;: 2010, &#x27;id&#x27;: &#x27;fdc8c466a8863b3533dfd0ae26e242f1e7f25c42&#x27;, &#x27;title&#x27;: &#x27;Template-directed molecular assembly on silicon carbide nanomesh: comparison between CuPc and pentacene.&#x27;, &#x27;doi&#x27;: &#x27;10.1021/nn901476m&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.052496863226406</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1164/rccm.201706-1222OC&#x27;, &#x27;year&#x27;: 2018, &#x27;id&#x27;: &#x27;6da2b414275874ba5efce9b29595bef6293c948b&#x27;, &#x27;title&#x27;: &#x27;Effect of Early-Life Geohelminth Infections on the Development of Wheezing at 5 Years of Age.&#x27;, &#x27;doi&#x27;: &#x27;10.1164/rccm.201706-1222OC&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0523864170070738</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.neucom.2006.08.003&#x27;, &#x27;year&#x27;: 2007, &#x27;id&#x27;: &#x27;a57bf47fb69fc00e943ecf85e47444dbc5bee07a&#x27;, &#x27;title&#x27;: &#x27;Exponential stability of impulsive neural networks with time-varying delays and reaction-diffusion terms&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.neucom.2006.08.003&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0381201731739567</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s11634-007-0014-z&#x27;, &#x27;year&#x27;: 2007, &#x27;id&#x27;: &#x27;7c9bc839a835244251cebd13a6fe5575b80ea290&#x27;, &#x27;title&#x27;: &#x27;A global algorithm to estimate the expectations of the components of an observed univariate mixture&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s11634-007-0014-z&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0378521719714628</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.jprot.2009.10.005&#x27;, &#x27;year&#x27;: 2010, &#x27;id&#x27;: &#x27;f6e0ef66d2a61f595a9481c964a7b6d8b8c9954b&#x27;, &#x27;title&#x27;: &#x27;Proteomics of the response of Arabidopsis thaliana to infection with Alternaria brassicicola.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.jprot.2009.10.005&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.029552291985601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.cag.2014.09.031&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;31ecf94c75026cf168d6db275fcecad83fbbe2f4&#x27;, &#x27;title&#x27;: &#x27;Sketch-based 3-D modeling for piecewise planar objects in single images&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.cag.2014.09.031&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0234295894857497</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.bbrc.2016.02.119&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;0eedfc361dbb624e345b5976e76da7b57d79ac1b&#x27;, &#x27;title&#x27;: &quot;Type 1 5&#x27;-deiodinase activity is inhibited by oxidative stress and restored by alpha-lipoic acid in HepG2 cells.&quot;, &#x27;doi&#x27;: &#x27;10.1016/j.bbrc.2016.02.119&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0095239312620834</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1053/seiz.1998.0240&#x27;, &#x27;year&#x27;: 1999, &#x27;id&#x27;: &#x27;b95193355f5e3823461f228d9b2b1ad2d7ffc1fe&#x27;, &#x27;title&#x27;: &#x27;Coping with refractory epilepsy&#x27;, &#x27;doi&#x27;: &#x27;10.1053/seiz.1998.0240&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0084996562451125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1177/1591019915623558&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;ed26a77ce2ffaa0ea2edd17afdd52f5642574b6f&#x27;, &#x27;title&#x27;: &#x27;Pipeline embolization device deployment via an envoy distal access XB guiding catheter-biaxial platform: A technical note.&#x27;, &#x27;doi&#x27;: &#x27;10.1177/1591019915623558&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.0084277882473542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.ajem.2015.04.003&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;eded0a1a0ff476c57fc3058ac893489c8e08415e&#x27;, &#x27;title&#x27;: &#x27;Cardiac arrest due to airway obstruction in hereditary angioedema.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.ajem.2015.04.003&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.007958131469786</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.4018/jkm.2011070103&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;9c683a8b53307bd54a2b0d0961957f07344e95e5&#x27;, &#x27;title&#x27;: &#x27;KM Approach for Improving the Labor Productivity of Vietnamese Enterprise&#x27;, &#x27;doi&#x27;: &#x27;10.4018/jkm.2011070103&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>1.002008658507839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s10620-006-9246-6&#x27;, &#x27;year&#x27;: 2006, &#x27;id&#x27;: &#x27;8c5b2a75e5dfe1fc8c03c410ecfd2f44a05fa4a0&#x27;, &#x27;title&#x27;: &#x27;Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s10620-006-9246-6&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.994670868292451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.3766/jaaa.21.8.6&#x27;, &#x27;year&#x27;: 2010, &#x27;id&#x27;: &#x27;d91d4584b212a2e4ab4a30a964390a9fa1094b3a&#x27;, &#x27;title&#x27;: &#x27;Effectiveness of the directional microphone in the Baha® Divino™.&#x27;, &#x27;doi&#x27;: &#x27;10.3766/jaaa.21.8.6&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.989427183708176</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.2215/CJN.08640811&#x27;, &#x27;year&#x27;: 2012, &#x27;id&#x27;: &#x27;2d98fecfa562e802a3aed0b4c395c8ce80fb6e5c&#x27;, &#x27;title&#x27;: &#x27;Renal monoclonal immunoglobulin deposition disease: a report of 64 patients from a single institution.&#x27;, &#x27;doi&#x27;: &#x27;10.2215/CJN.08640811&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9865689937025309</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1038/ncpgasthep0437&#x27;, &#x27;year&#x27;: 2006, &#x27;id&#x27;: &#x27;4066d32ea945360ad9224eed0d3c8aa45d4900f2&#x27;, &#x27;title&#x27;: &#x27;Living donor liver transplantation for pediatric and adult recipients&#x27;, &#x27;doi&#x27;: &#x27;10.1038/ncpgasthep0437&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9850273455725985</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1038/sj.ejcn.1601965&#x27;, &#x27;year&#x27;: 2004, &#x27;id&#x27;: &#x27;ba41fce57a3f01724d255b489759d2332943c865&#x27;, &#x27;title&#x27;: &#x27;Validity and reproducibility of a computerised tool for assessing the iron, calcium and vitamin C intake of Belgian women&#x27;, &#x27;doi&#x27;: &#x27;10.1038/sj.ejcn.1601965&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9841194587061183</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s10926-005-9006-z&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;8fb9c95bf34a0f28dc05819cb4aada0cb94fe555&#x27;, &#x27;title&#x27;: &#x27;Development of Work Stress Scale for Correctional Officers&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s10926-005-9006-z&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9737479702569543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/BF02270828&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;ed6f7f0d65f4c8bde43f13667c406ff3403f9814&#x27;, &#x27;title&#x27;: &#x27;Predation, seed size partitioning and the evolution of body size in seed-eating finches&#x27;, &#x27;doi&#x27;: &#x27;10.1007/BF02270828&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9657251187600195</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s004649900359&#x27;, &#x27;year&#x27;: 1997, &#x27;id&#x27;: &#x27;d72eeacd4b5c694059ca575335e161c5beada79b&#x27;, &#x27;title&#x27;: &#x27;Cardiopulmonary responses to intravenous infusion of soluble and relatively insoluble gases&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s004649900359&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.965659030014649</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1111/cdev.12340&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;f832cb5a2e43832edc0ab395c757a133e0994fae&#x27;, &#x27;title&#x27;: &#x27;Infants learn baby signs from video.&#x27;, &#x27;doi&#x27;: &#x27;10.1111/cdev.12340&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9630920749856161</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/BF00284683&#x27;, &#x27;year&#x27;: 1993, &#x27;id&#x27;: &#x27;f0888ca406fc5ea91e8d0212052b781b8a930cf3&#x27;, &#x27;title&#x27;: &#x27;Characterization of an Aspartic Proteinase of Mucor pusillus expressed in Aspergillus oryzae&#x27;, &#x27;doi&#x27;: &#x27;10.1007/BF00284683&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9621557335834952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.ijcard.2009.06.058&#x27;, &#x27;year&#x27;: 2010, &#x27;id&#x27;: &#x27;864ca4044d2ebf88ae4bf45df730f571039488b3&#x27;, &#x27;title&#x27;: &#x27;Heart rate dynamics in different levels of Zen meditation.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.ijcard.2009.06.058&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9591657056938859</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1177/0306624X08323158&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;193ae042e6c11bd5f19b3f24c99cfda1e7fd658b&#x27;, &#x27;title&#x27;: &#x27;The role of violence in street crime: a qualitative study of violent offenders.&#x27;, &#x27;doi&#x27;: &#x27;10.1177/0306624X08323158&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9513828524854034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/TIT.2005.860472&#x27;, &#x27;year&#x27;: 2006, &#x27;id&#x27;: &#x27;7d0630dbeec4a46493496167778ed5f9410b1b0d&#x27;, &#x27;title&#x27;: &#x27;An algorithm for counting short cycles in bipartite graphs&#x27;, &#x27;doi&#x27;: &#x27;10.1109/TIT.2005.860472&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9511361380573364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s00355-005-0021-y&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;9df19587849ca5cd98e43b6072aaa122efb5a29f&#x27;, &#x27;title&#x27;: &#x27;Poverty measurement: the critical comparison value&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s00355-005-0021-y&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.941839044727385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/BF01906346&#x27;, &#x27;year&#x27;: 1977, &#x27;id&#x27;: &#x27;ea4d7b1168128acbd3c4f2a990fae09a7526a6d2&#x27;, &#x27;title&#x27;: &#x27;The instantaneous force-velocity relationship as an index of the contractile state in cardiac muscle&#x27;, &#x27;doi&#x27;: &#x27;10.1007/BF01906346&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9329161367146298</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s10393-017-1238-9&#x27;, &#x27;year&#x27;: 2017, &#x27;id&#x27;: &#x27;72f954ce63cd2a1211bba18266655ee1ea8d4615&#x27;, &#x27;title&#x27;: &#x27;Enteroparasitoses and Toxocarosis Affecting Children from Mar del Plata City, Argentina&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s10393-017-1238-9&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9141675797756763</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1080/10810730.2011.604384&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;cb05521fc110b9845b8bb42afdec6c23d7f679be&#x27;, &#x27;title&#x27;: &#x27;Misunderstanding and potential unintended misuse of acetaminophen among adolescents and young adults.&#x27;, &#x27;doi&#x27;: &#x27;10.1080/10810730.2011.604384&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9093358647311108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s11104-006-9059-6&#x27;, &#x27;year&#x27;: 2006, &#x27;id&#x27;: &#x27;9eb937a0eff3b0fc1b3accf6a68be6259d1a24b4&#x27;, &#x27;title&#x27;: &#x27;Phosphate solubilization activity of rhizobia native to Iranian soils&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s11104-006-9059-6&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.9072952883318067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s00439-003-1056-8&#x27;, &#x27;year&#x27;: 2003, &#x27;id&#x27;: &#x27;36efcd42e8fbe18e0e1baf6c2696e2971aee78b2&#x27;, &#x27;title&#x27;: &#x27;Apolipoprotein B-100 XbaI gene polymorphism in gallbladder cancer&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s00439-003-1056-8&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8988811540184543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.cpcardiol.2015.11.002&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;d7a46e7c63f78c8fa2088e144ebd60bcfd73131f&#x27;, &#x27;title&#x27;: &#x27;Preexcitation Syndromes.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.cpcardiol.2015.11.002&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8969598049297929</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.forsciint.2015.12.033&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;a37913935bb44f54d54327927fc9dec2c4f68444&#x27;, &#x27;title&#x27;: &#x27;Determination of phenobarbital in hair matrix by liquid phase microextraction (LPME) and gas chromatography-mass spectrometry (GC-MS).&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.forsciint.2015.12.033&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8924177154898645</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1046/j.1525-1497.1999.00018.x&#x27;, &#x27;year&#x27;: 1999, &#x27;id&#x27;: &#x27;c4062742b4e0d13cfa0e992fdf2cebf2eb71c415&#x27;, &#x27;title&#x27;: &#x27;Patient preferences for colon cancer screening&#x27;, &#x27;doi&#x27;: &#x27;10.1046/j.1525-1497.1999.00018.x&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8920758141903208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1089/bfm.2012.0092&#x27;, &#x27;year&#x27;: 2013, &#x27;id&#x27;: &#x27;95b130dc301005b517b87ea498aa9495cc9360b0&#x27;, &#x27;title&#x27;: &#x27;Facial responses to basic tastes in breastfeeding and formula-feeding infants.&#x27;, &#x27;doi&#x27;: &#x27;10.1089/bfm.2012.0092&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8780886376742274</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.acra.2010.08.024&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;7bbffaf73092220bfc3cb2a0a6d34ded8d680c7d&#x27;, &#x27;title&#x27;: &#x27;Predictors of clinical outcome in acute pulmonary embolism: Correlation of CT pulmonary angiography with clinical, echocardiography and laboratory findings.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.acra.2010.08.024&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.863149801432155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1021/acsami.6b01557&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;9aab4c51cf2efe0fa5fb92420ec205aee6546ddc&#x27;, &#x27;title&#x27;: &#x27;Solar Hydrogen Production Using Molecular Catalysts Immobilized on Gallium Phosphide (111)A and (111)B Polymer-Modified Photocathodes.&#x27;, &#x27;doi&#x27;: &#x27;10.1021/acsami.6b01557&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8563292362960054</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1137/060659211&#x27;, &#x27;year&#x27;: 2007, &#x27;id&#x27;: &#x27;c40ac08b6ebce636bca8286cbdcb3ffcba9fec85&#x27;, &#x27;title&#x27;: &#x27;Stability and Bifurcation Analysis of Volterra Functional Equations in the Light of Suns and Stars&#x27;, &#x27;doi&#x27;: &#x27;10.1137/060659211&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.855267160036601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1038/bjc.1990.274&#x27;, &#x27;year&#x27;: 1990, &#x27;id&#x27;: &#x27;f218ce53248d756db61726985f73e6e8c109b3e2&#x27;, &#x27;title&#x27;: &#x27;Coffee consumption and the risk of breast cancer. A prospective study of 14,593 Norwegian women.&#x27;, &#x27;doi&#x27;: &#x27;10.1038/bjc.1990.274&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8512859822483734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1093/toxsci/kfr250&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;421da3edd7d840ce58b811d2ad62dac3dafc7663&#x27;, &#x27;title&#x27;: &#x27;Evaluation of novel high-throughput embryonic stem cell tests with new molecular markers for screening embryotoxic chemicals in vitro.&#x27;, &#x27;doi&#x27;: &#x27;10.1093/toxsci/kfr250&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8468823470873758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/91.784206&#x27;, &#x27;year&#x27;: 1999, &#x27;id&#x27;: &#x27;ad2927cbb1245540b8bb2c55d08e29c25cc11e76&#x27;, &#x27;title&#x27;: &#x27;A fuzzy k-modes algorithm for clustering categorical data&#x27;, &#x27;doi&#x27;: &#x27;10.1109/91.784206&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8455171056790275</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.oooo.2012.02.002&#x27;, &#x27;year&#x27;: 2012, &#x27;id&#x27;: &#x27;b4253ff9f61743fab39342cb4e47b6f9b88e004c&#x27;, &#x27;title&#x27;: &#x27;Effect of erythrosine- and LED-mediated photodynamic therapy on buccal candidiasis infection of immunosuppressed mice and Candida albicans adherence to buccal epithelial cells.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.oooo.2012.02.002&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.845245483587496</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/ICASSP.2005.1416059&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;27e83ae2c5473ccb6bfa25f087e2c239d62a575f&#x27;, &#x27;title&#x27;: &#x27;Improved modulation spectrum through multi-scale modulation frequency decomposition&#x27;, &#x27;doi&#x27;: &#x27;10.1109/ICASSP.2005.1416059&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8394870861433446</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/BF00213601&#x27;, &#x27;year&#x27;: 1992, &#x27;id&#x27;: &#x27;b27d348dfcbf4346c6ba9e932cdffc1d7d98e5fc&#x27;, &#x27;title&#x27;: &#x27;Meso-diencephalic regions projecting to spinal cord and dorsal column nuclear complex in the hedgehog-tenrec, Echinops telfairi&#x27;, &#x27;doi&#x27;: &#x27;10.1007/BF00213601&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.82864213953726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1093/ejcts/ezr054&#x27;, &#x27;year&#x27;: 2012, &#x27;id&#x27;: &#x27;a227eb8781e527afd5cb795ecf1de214fc7351fd&#x27;, &#x27;title&#x27;: &#x27;False-positivity of mediastinal lymph nodes has negative effect on survival in potentially resectable non-small cell lung cancer.&#x27;, &#x27;doi&#x27;: &#x27;10.1093/ejcts/ezr054&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8183952887542548</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s11064-008-9733-6&#x27;, &#x27;year&#x27;: 2008, &#x27;id&#x27;: &#x27;e3a9cc9bc08fa447463d46629aa24e2c78cdd87e&#x27;, &#x27;title&#x27;: &#x27;Mu-Opioid Receptor in the Nucleus Submedius: Involvement in Opioid-Induced Inhibition of Mirror-Image Allodynia in a Rat Model of Neuropathic Pain&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s11064-008-9733-6&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.812637914880179</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1146/annurev-anchem-071213-020051&#x27;, &#x27;year&#x27;: 2015, &#x27;id&#x27;: &#x27;2cc15e5ffd6a3cc904be7d2f5edc11f9304582dc&#x27;, &#x27;title&#x27;: &#x27;Cell-Based Microarrays for In Vitro Toxicology.&#x27;, &#x27;doi&#x27;: &#x27;10.1146/annurev-anchem-071213-020051&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.808841254399158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1073/pnas.1219425110&#x27;, &#x27;year&#x27;: 2013, &#x27;id&#x27;: &#x27;16ebb4953469bae609d81f1dd1b879b623c15004&#x27;, &#x27;title&#x27;: &#x27;Evidence for maize (Zea mays) in the Late Archaic (3000-1800 B.C.) in the Norte Chico region of Peru.&#x27;, &#x27;doi&#x27;: &#x27;10.1073/pnas.1219425110&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8072126344777645</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.3978/j.issn.2305-5839.2014.02.10&#x27;, &#x27;year&#x27;: 2014, &#x27;id&#x27;: &#x27;b87d1a177d07a8e7d66be4c9fb70ea0a03154772&#x27;, &#x27;title&#x27;: &#x27;Pulmonary carcinosarcoma with heterologous component: report of two cases with literature review.&#x27;, &#x27;doi&#x27;: &#x27;10.3978/j.issn.2305-5839.2014.02.10&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.803605417185463</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s11738-009-0330-3&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;e06da9b34d6d1a7b57b27b5880c608c241adc5a2&#x27;, &#x27;title&#x27;: &#x27;In vitro propagation of Psoralea corylifolia L. by somatic embryogenesis in cell suspension culture&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s11738-009-0330-3&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.8027079100953415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.acvd.2008.09.009&#x27;, &#x27;year&#x27;: 2008, &#x27;id&#x27;: &#x27;0640d73669a32710123c539876393677872c7918&#x27;, &#x27;title&#x27;: &#x27;Quantification of mitral-valve regurgitation in a paediatric population by real-time three-dimensional echocardiography.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.acvd.2008.09.009&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7922009640606124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1177/0363546509331941&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;ba530799050f96c5ceb76eff2ba6a241df0cdf0b&#x27;, &#x27;title&#x27;: &#x27;Replication of the range of native anterior cruciate ligament fiber length change behavior achieved by different grafts: measurement using computer-assisted navigation.&#x27;, &#x27;doi&#x27;: &#x27;10.1177/0363546509331941&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7862058009253815</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.3390/rs8110927&#x27;, &#x27;year&#x27;: 2016, &#x27;id&#x27;: &#x27;0fbe46932967ec0db80b18e70fa199fb652313ea&#x27;, &#x27;title&#x27;: &#x27;Regionalization of Uncovered Agricultural Soils Based on Organic Carbon and Soil Texture Estimations&#x27;, &#x27;doi&#x27;: &#x27;10.3390/rs8110927&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7783485742285848</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1172/JCI89281&#x27;, &#x27;year&#x27;: 2017, &#x27;id&#x27;: &#x27;1f208e6cba1570030c11bedc0fa0465b613ec0f7&#x27;, &#x27;title&#x27;: &#x27;Membrane-organizing protein moesin controls Treg differentiation and antitumor immunity via TGF-β signaling.&#x27;, &#x27;doi&#x27;: &#x27;10.1172/JCI89281&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7775574384722855</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.mcm.2007.06.029&#x27;, &#x27;year&#x27;: 2008, &#x27;id&#x27;: &#x27;6f06076133abe3cd3bfed4d2f20c3fd97eef3702&#x27;, &#x27;title&#x27;: &quot;A fuzzy nonlinear model for quality function deployment considering Kano&#x27;s concept&quot;, &#x27;doi&#x27;: &#x27;10.1016/j.mcm.2007.06.029&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7774255139054733</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s00381-009-0954-z&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;0b4af9555c95dd8f64bcf45de86c7f380f3eac73&#x27;, &#x27;title&#x27;: &#x27;Pott’s puffy tumor in children&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s00381-009-0954-z&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7662392771337182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/BF02818614&#x27;, &#x27;year&#x27;: 1998, &#x27;id&#x27;: &#x27;b1b12644378d1e61f298e247ad936f0a16bb9989&#x27;, &#x27;title&#x27;: &#x27;Cytotoxic necrotizing factor 1 fromEscherichia coli: a toxin with a new intracellular activity for eukaryotic cells&#x27;, &#x27;doi&#x27;: &#x27;10.1007/BF02818614&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7644681830657647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s00432-009-0572-x&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;5cfdb256b6ae968374469bd36702ed341cfe9485&#x27;, &#x27;title&#x27;: &#x27;A joint detection of CEA and CA-50 levels in saliva and serum of patients with tumors in oral region and salivary gland&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s00432-009-0572-x&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7399670760147273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.cell.2009.08.047&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;9d82517bef50ee79c57609834eb165961e33d4f7&#x27;, &#x27;title&#x27;: &#x27;Regulation of MBK-2/DYRK by CDK-1 and the Pseudophosphatases EGG-4 and EGG-5 during the Oocyte-to-Embryo Transition&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.cell.2009.08.047&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7375554257771001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s002470050350&#x27;, &#x27;year&#x27;: 1998, &#x27;id&#x27;: &#x27;3bfb9955d7fb268294ec392aa6465a0ef95dce7e&#x27;, &#x27;title&#x27;: &#x27;MR imaging of a pilomatrixoma&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s002470050350&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7365450655343009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/TSMCC.2005.848191&#x27;, &#x27;year&#x27;: 2005, &#x27;id&#x27;: &#x27;02fc5fada3a31fc2b128b4784fd2e8c8a75b8b08&#x27;, &#x27;title&#x27;: &#x27;An adaptive multimodal biometric management algorithm&#x27;, &#x27;doi&#x27;: &#x27;10.1109/TSMCC.2005.848191&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7281454955227674</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1016/j.biotechadv.2009.04.011&#x27;, &#x27;year&#x27;: 2009, &#x27;id&#x27;: &#x27;04547565eae033cbd9826ca4e31b8cf00e2b2400&#x27;, &#x27;title&#x27;: &#x27;Biomass-oxygen gasification in a high-temperature entrained-flow gasifier.&#x27;, &#x27;doi&#x27;: &#x27;10.1016/j.biotechadv.2009.04.011&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7227886985288934</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1073/pnas.1403814111&#x27;, &#x27;year&#x27;: 2014, &#x27;id&#x27;: &#x27;f9b4d45b0b6135dfecab5aa950b11f7b17267e91&#x27;, &#x27;title&#x27;: &#x27;DICER1/Alu RNA dysmetabolism induces Caspase-8-mediated cell death in age-related macular degeneration.&#x27;, &#x27;doi&#x27;: &#x27;10.1073/pnas.1403814111&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7090221536112952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1007/s00395-014-0446-5&#x27;, &#x27;year&#x27;: 2014, &#x27;id&#x27;: &#x27;11781ea072a749847253639a9903e8b796d51e54&#x27;, &#x27;title&#x27;: &#x27;Complex Brugada syndrome inheritance in a family harbouring compound SCN5A and CACNA1C mutations&#x27;, &#x27;doi&#x27;: &#x27;10.1007/s00395-014-0446-5&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.7010616733925418</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1023/A:1016097312036&#x27;, &#x27;year&#x27;: 2002, &#x27;id&#x27;: &#x27;a05b1e526645868d6f664a81a7fb7205ffc147e4&#x27;, &#x27;title&#x27;: &#x27;Leaf discs floated on water are different from intact leaves in photosynthesis and photoinhibition&#x27;, &#x27;doi&#x27;: &#x27;10.1023/A:1016097312036&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.6973325479542839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.1109/ICASSP.2006.1660679&#x27;, &#x27;year&#x27;: 2006, &#x27;id&#x27;: &#x27;3dffad910b096a2065f292ace889567ba219d40a&#x27;, &#x27;title&#x27;: &#x27;The Multiple-Parameter Discrete Fractional Fourier Transform and Its Application&#x27;, &#x27;doi&#x27;: &#x27;10.1109/ICASSP.2006.1660679&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.6971417890861631</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;doi_url&#x27;: &#x27;https://doi.org/10.3233/IKS-2012-0197&#x27;, &#x27;year&#x27;: 2011, &#x27;id&#x27;: &#x27;0728b111bd17fda94b4861e79689edc01e492226&#x27;, &#x27;title&#x27;: &#x27;Causal inference and heterogeneity bias in social science&#x27;, &#x27;doi&#x27;: &#x27;10.3233/IKS-2012-0197&#x27;}, {}, {&#x27;name&#x27;: &#x27;databases&#x27;, &#x27;fake&#x27;: True}]</td>\n",
       "        <td>0.649416531692259</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'doi_url': 'https://doi.org/10.1097/SIH.0b013e31825e8bcf',\n",
       "    'year': 2012,\n",
       "    'id': 'c104539460e4e4eac8b630ac81ef04d45a683286',\n",
       "    'title': '\"Bump\":  using a mobile app to enhance learning in simulation scenarios.',\n",
       "    'doi': '10.1097/SIH.0b013e31825e8bcf'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.3380366005469115],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s00266-005-0131-z',\n",
       "    'year': 2005,\n",
       "    'id': '6d246d9ffb02ada8a3e3b4dc11cd14bd36468290',\n",
       "    'title': 'Linear Hypopigmentation After Triamcinolone Injection: A Rare Complication of a Common Procedure',\n",
       "    'doi': '10.1007/s00266-005-0131-z'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.2711560409981755],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s11010-014-2228-7',\n",
       "    'year': 2014,\n",
       "    'id': '665c0f7c26ba4c5b99fea43ac85509200a76dfe8',\n",
       "    'title': 'Oleanolic acid suppresses the proliferation of lung carcinoma cells by miR-122/Cyclin G1/MEF2D axis',\n",
       "    'doi': '10.1007/s11010-014-2228-7'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.2702508100308478],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s002700010039',\n",
       "    'year': 2000,\n",
       "    'id': '7f332daa1c7f6556c2094af68c512fa532349ec1',\n",
       "    'title': 'Acetic acid as a sclerosing agent for renal cysts: Comparison with ethanol in follow-up results',\n",
       "    'doi': '10.1007/s002700010039'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.2594134361017493],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.imavis.2006.04.013',\n",
       "    'year': 2008,\n",
       "    'id': '4a2a536bc9ed1d032a41a6c0507cfc0dd714bab6',\n",
       "    'title': 'Restoration of blue scratches in digital image sequences',\n",
       "    'doi': '10.1016/j.imavis.2006.04.013'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.2585701291449365],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/ICASSP.2007.366746',\n",
       "    'year': 2007,\n",
       "    'id': 'a17699a73ac3c6dc8bcec10ecc420857d88eb632',\n",
       "    'title': 'Signal Processing Model and Receiver Algorithms for a Higher Rate Multi-User TR-UWB System',\n",
       "    'doi': '10.1109/ICASSP.2007.366746'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.230960787693039],\n",
       " [[{'doi_url': 'https://doi.org/10.1111/idh.12112',\n",
       "    'year': 2015,\n",
       "    'id': '7ec7fd995b8d81c5ccf58806569391efb520a5d2',\n",
       "    'title': 'Efficacy of dental floss impregnated with chlorhexidine on reduction of supragingival biofilm: a randomized controlled trial.',\n",
       "    'doi': '10.1111/idh.12112'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.2180380919948224],\n",
       " [[{'doi_url': 'https://doi.org/10.1021/acsami.7b00092',\n",
       "    'year': 2017,\n",
       "    'id': 'a2dc6402747f633f5e25c4e37b9debe5efe0dc26',\n",
       "    'title': 'Enabling Inkjet Printed Graphene for Ion Selective Electrodes with Postprint Thermal Annealing.',\n",
       "    'doi': '10.1021/acsami.7b00092'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.212353684892878],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.engappai.2008.04.018',\n",
       "    'year': 2009,\n",
       "    'id': '2c86deb0e77a7fb9853472ec39749d209adb9440',\n",
       "    'title': 'Automatic semantic indexing of medical images using a web ontology language for case-based image retrieval',\n",
       "    'doi': '10.1016/j.engappai.2008.04.018'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1766117617487908],\n",
       " [[{'doi_url': 'https://doi.org/10.1159/000470896',\n",
       "    'year': 2017,\n",
       "    'id': '65d67e1d3f74b749dfdaa8debf902e337c92dbd0',\n",
       "    'title': 'Use of an Osteoblast Overload Damage Model to Probe the Effect of Icariin on the Proliferation, Differentiation and Mineralization of MC3T3-E1 Cells through the Wnt/β-Catenin Signalling Pathway.',\n",
       "    'doi': '10.1159/000470896'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1721596704795958],\n",
       " [[{'doi_url': 'https://doi.org/10.4049/jimmunol.1102845',\n",
       "    'year': 2012,\n",
       "    'id': '1799f8fd782a5028eeccbed2daa6959b08b66308',\n",
       "    'title': 'Leishmania donovani exploits host deubiquitinating enzyme A20, a negative regulator of TLR signaling, to subvert host immune response.',\n",
       "    'doi': '10.4049/jimmunol.1102845'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1610586579889057],\n",
       " [[{'doi_url': 'https://doi.org/10.1111/j.1532-849X.2008.00372.x',\n",
       "    'year': 2009,\n",
       "    'id': 'd6b5d08c93118db6aec30331af5ae7c65da003c1',\n",
       "    'title': 'Influence of investment, disinfection, and storage on the microhardness of ocular resins.',\n",
       "    'doi': '10.1111/j.1532-849X.2008.00372.x'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1533227710518983],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/TE.2015.2498120',\n",
       "    'year': 2016,\n",
       "    'id': '8184f36abc1eec1d031fc897454808c48b0963c7',\n",
       "    'title': 'Virtual Laboratory for QoS Study in Next-Generation Networks With Metro Ethernet Access',\n",
       "    'doi': '10.1109/TE.2015.2498120'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1472146431449803],\n",
       " [[{'doi_url': 'https://doi.org/10.1097/PAS.0b013e318212ae22',\n",
       "    'year': 2011,\n",
       "    'id': 'b8be59215c7f983bd1e3fbfc65e441c3ac2c618d',\n",
       "    'title': 'The anterior gradient homolog 3 (AGR3) gene is associated with differentiation and survival in ovarian cancer.',\n",
       "    'doi': '10.1097/PAS.0b013e318212ae22'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1311789225321265],\n",
       " [[{'doi_url': 'https://doi.org/10.1186/1471-2377-9-47',\n",
       "    'year': 2009,\n",
       "    'id': '0d890bec1cf9adedbe8683e0f7b7ec208cb35ed3',\n",
       "    'title': \"Quality of Life as an outcome in Alzheimer's disease and other dementias- obstacles and goals\",\n",
       "    'doi': '10.1186/1471-2377-9-47'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1242389115970581],\n",
       " [[{'doi_url': 'https://doi.org/10.1021/acsami.7b05583',\n",
       "    'year': 2017,\n",
       "    'id': 'b67f04742496fb29ebc02de237b6fa039efcae4b',\n",
       "    'title': 'Cu2+-Loaded Polydopamine Nanoparticles for Magnetic Resonance Imaging-Guided pH- and Near-Infrared-Light-Stimulated Thermochemotherapy.',\n",
       "    'doi': '10.1021/acsami.7b05583'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1143295769114046],\n",
       " [[{'doi_url': 'https://doi.org/10.1128/JVI.02450-10',\n",
       "    'year': 2011,\n",
       "    'id': '40ee9c895397af6326cbcf97f6448c8419940074',\n",
       "    'title': 'Shared ancestry between a newfound mole-borne hantavirus and hantaviruses harbored by cricetid rodents.',\n",
       "    'doi': '10.1128/JVI.02450-10'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1130660441704099],\n",
       " [[{'doi_url': 'https://doi.org/10.1093/humrep/dep288',\n",
       "    'year': 2009,\n",
       "    'id': '25aa00f2fd8ca7dfbafb35d6d88fc3189e649c2f',\n",
       "    'title': 'Effects of the levonorgestrel-releasing intrauterine system on cell proliferation, Fas expression and steroid receptors in endometriosis lesions and normal endometrium.',\n",
       "    'doi': '10.1093/humrep/dep288'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1088391794823111],\n",
       " [[{'doi_url': 'https://doi.org/10.1504/IJMIC.2015.069946',\n",
       "    'year': 2015,\n",
       "    'id': '47813eb5d731387ec5e17ead82fdc03ce18992b3',\n",
       "    'title': 'Sliding mode control of a hydraulic servo system position using adaptive sliding surface and adaptive gain',\n",
       "    'doi': '10.1504/IJMIC.2015.069946'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.1021982037927953],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.ultsonch.2012.12.003',\n",
       "    'year': 2013,\n",
       "    'id': '2e277347fdc70287c56a4276d9d2e69055e3ecc8',\n",
       "    'title': 'Removal of pharmaceuticals from wastewater by biological processes, hydrodynamic cavitation and UV treatment.',\n",
       "    'doi': '10.1016/j.ultsonch.2012.12.003'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0946752542629836],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s10107-009-0289-2',\n",
       "    'year': 2011,\n",
       "    'id': '00a234d1634e2335778b40aeacf0482ad5e2d70f',\n",
       "    'title': 'A Partition-Based Relaxation For Steiner Trees',\n",
       "    'doi': '10.1007/s10107-009-0289-2'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0919139780569822],\n",
       " [[{'doi_url': 'https://doi.org/10.2316/Journal.201.2005.2.201-1420',\n",
       "    'year': 2005,\n",
       "    'id': 'a09c196f66e8b5f44a7b734862a2a00e66d079a5',\n",
       "    'title': 'Modelling, Identification, and Compensation of Complex Hysteretic and log(t)-Type Creep Nonlinearities',\n",
       "    'doi': '10.2316/Journal.201.2005.2.201-1420'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0858077373821289],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.jphotobiol.2013.02.013',\n",
       "    'year': 2013,\n",
       "    'id': 'b67957a448829ca529abdabd1d300f25aa3272c2',\n",
       "    'title': 'Targeted in vitro photodynamic therapy via aptamer-labeled, porphyrin-loaded virus capsids.',\n",
       "    'doi': '10.1016/j.jphotobiol.2013.02.013'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0850889932829886],\n",
       " [[{'doi_url': 'https://doi.org/10.1093/hmg/ddv308',\n",
       "    'year': 2015,\n",
       "    'id': '0e341266be3de53a748234164d7bca164b2b6862',\n",
       "    'title': 'Loss of fibulin-4 disrupts collagen synthesis and maturation: implications for pathology resulting from EFEMP2 mutations.',\n",
       "    'doi': '10.1093/hmg/ddv308'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0815894586499781],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/TIFS.2015.2512533',\n",
       "    'year': 2016,\n",
       "    'id': 'c5530c42f7783edbf44854de2b5f1c82b6c28bf7',\n",
       "    'title': 'Hierarchical and Shared Access Control',\n",
       "    'doi': '10.1109/TIFS.2015.2512533'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0774257703218608],\n",
       " [[{'doi_url': 'https://doi.org/10.1021/acsami.5b05150',\n",
       "    'year': 2015,\n",
       "    'id': 'a15e904d4c44b9d2e7fc733307664a5faa5f7a93',\n",
       "    'title': 'Conjugated Polymer-Based Hybrid Nanoparticles with Two-Photon Excitation and Near-Infrared Emission Features for Fluorescence Bioimaging within the Biological Window.',\n",
       "    'doi': '10.1021/acsami.5b05150'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0754604017827656],\n",
       " [[{'doi_url': 'https://doi.org/10.1038/sj.cdd.4401146',\n",
       "    'year': 2003,\n",
       "    'id': '75f51d9d39ce66aad6fd5e6ab7147bad3b1e0db7',\n",
       "    'title': 'Mapping the initial DNA breaks in apoptotic Jurkat cells using ligation-mediated PCR',\n",
       "    'doi': '10.1038/sj.cdd.4401146'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.073032755590975],\n",
       " [[{'doi_url': 'https://doi.org/10.1006/jpdc.1997.1351',\n",
       "    'year': 1997,\n",
       "    'id': '7a69f0020f6131fb0fd82d7ae3c30300c694c8b4',\n",
       "    'title': 'Fast Runtime Block Cyclic Data Redistribution on Multiprocessors',\n",
       "    'doi': '10.1006/jpdc.1997.1351'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0729917308548464],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/COMPSAC.2009.168',\n",
       "    'year': 2009,\n",
       "    'id': '620f551944ec63cd5b8559c572c40b29205dc06a',\n",
       "    'title': 'Penetration Testing for Spam Filters',\n",
       "    'doi': '10.1109/COMPSAC.2009.168'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.072659146180376],\n",
       " [[{'doi_url': 'https://doi.org/10.1111/1742-6723.12535',\n",
       "    'year': 2016,\n",
       "    'id': 'bfea5a8c0ed0bc15ff8365e39c8035f7eb7f50d3',\n",
       "    'title': 'Identifying the risk of compassion fatigue, improving compassion satisfaction and building resilience in emergency medicine.',\n",
       "    'doi': '10.1111/1742-6723.12535'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0702580779790878],\n",
       " [[{'doi_url': 'https://doi.org/10.1142/S0219525913500367',\n",
       "    'year': 2013,\n",
       "    'id': '82e8de5c4be2aa76e670e17e21db73edbb3d5a56',\n",
       "    'title': 'Evolution of Cooperation in the Snowdrift Game with Heterogeneous Population',\n",
       "    'doi': '10.1142/S0219525913500367'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0675442358944565],\n",
       " [[{'doi_url': 'https://doi.org/10.1128/JVI.02744-14',\n",
       "    'year': 2015,\n",
       "    'id': 'd5535a9cf734f134dda26619a3ac09025463f90f',\n",
       "    'title': 'Interferon-induced Ifit proteins: their role in viral pathogenesis.',\n",
       "    'doi': '10.1128/JVI.02744-14'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0610442282864823],\n",
       " [[{'doi_url': 'https://doi.org/10.1089/sur.2016.107',\n",
       "    'year': 2016,\n",
       "    'id': 'acaa12d900e5a682f399162091845f8ad47a03f4',\n",
       "    'title': 'Topical Antimicrobials and the Open Surgical Wound.',\n",
       "    'doi': '10.1089/sur.2016.107'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0603097989456731],\n",
       " [[{'doi_url': 'https://doi.org/10.1038/nature09256',\n",
       "    'year': 2010,\n",
       "    'id': '35e72f5eafce5d0a8853add98956d5ec2f58d9f4',\n",
       "    'title': 'Quantum entanglement between an optical photon and a solid-state spin qubit',\n",
       "    'doi': '10.1038/nature09256'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0598974862368775],\n",
       " [[{'doi_url': 'https://doi.org/10.1021/nn901476m',\n",
       "    'year': 2010,\n",
       "    'id': 'fdc8c466a8863b3533dfd0ae26e242f1e7f25c42',\n",
       "    'title': 'Template-directed molecular assembly on silicon carbide nanomesh: comparison between CuPc and pentacene.',\n",
       "    'doi': '10.1021/nn901476m'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.052496863226406],\n",
       " [[{'doi_url': 'https://doi.org/10.1164/rccm.201706-1222OC',\n",
       "    'year': 2018,\n",
       "    'id': '6da2b414275874ba5efce9b29595bef6293c948b',\n",
       "    'title': 'Effect of Early-Life Geohelminth Infections on the Development of Wheezing at 5 Years of Age.',\n",
       "    'doi': '10.1164/rccm.201706-1222OC'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0523864170070738],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.neucom.2006.08.003',\n",
       "    'year': 2007,\n",
       "    'id': 'a57bf47fb69fc00e943ecf85e47444dbc5bee07a',\n",
       "    'title': 'Exponential stability of impulsive neural networks with time-varying delays and reaction-diffusion terms',\n",
       "    'doi': '10.1016/j.neucom.2006.08.003'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0381201731739567],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s11634-007-0014-z',\n",
       "    'year': 2007,\n",
       "    'id': '7c9bc839a835244251cebd13a6fe5575b80ea290',\n",
       "    'title': 'A global algorithm to estimate the expectations of the components of an observed univariate mixture',\n",
       "    'doi': '10.1007/s11634-007-0014-z'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0378521719714628],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.jprot.2009.10.005',\n",
       "    'year': 2010,\n",
       "    'id': 'f6e0ef66d2a61f595a9481c964a7b6d8b8c9954b',\n",
       "    'title': 'Proteomics of the response of Arabidopsis thaliana to infection with Alternaria brassicicola.',\n",
       "    'doi': '10.1016/j.jprot.2009.10.005'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.029552291985601],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.cag.2014.09.031',\n",
       "    'year': 2015,\n",
       "    'id': '31ecf94c75026cf168d6db275fcecad83fbbe2f4',\n",
       "    'title': 'Sketch-based 3-D modeling for piecewise planar objects in single images',\n",
       "    'doi': '10.1016/j.cag.2014.09.031'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0234295894857497],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.bbrc.2016.02.119',\n",
       "    'year': 2016,\n",
       "    'id': '0eedfc361dbb624e345b5976e76da7b57d79ac1b',\n",
       "    'title': \"Type 1 5'-deiodinase activity is inhibited by oxidative stress and restored by alpha-lipoic acid in HepG2 cells.\",\n",
       "    'doi': '10.1016/j.bbrc.2016.02.119'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0095239312620834],\n",
       " [[{'doi_url': 'https://doi.org/10.1053/seiz.1998.0240',\n",
       "    'year': 1999,\n",
       "    'id': 'b95193355f5e3823461f228d9b2b1ad2d7ffc1fe',\n",
       "    'title': 'Coping with refractory epilepsy',\n",
       "    'doi': '10.1053/seiz.1998.0240'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0084996562451125],\n",
       " [[{'doi_url': 'https://doi.org/10.1177/1591019915623558',\n",
       "    'year': 2016,\n",
       "    'id': 'ed26a77ce2ffaa0ea2edd17afdd52f5642574b6f',\n",
       "    'title': 'Pipeline embolization device deployment via an envoy distal access XB guiding catheter-biaxial platform: A technical note.',\n",
       "    'doi': '10.1177/1591019915623558'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.0084277882473542],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.ajem.2015.04.003',\n",
       "    'year': 2015,\n",
       "    'id': 'eded0a1a0ff476c57fc3058ac893489c8e08415e',\n",
       "    'title': 'Cardiac arrest due to airway obstruction in hereditary angioedema.',\n",
       "    'doi': '10.1016/j.ajem.2015.04.003'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.007958131469786],\n",
       " [[{'doi_url': 'https://doi.org/10.4018/jkm.2011070103',\n",
       "    'year': 2011,\n",
       "    'id': '9c683a8b53307bd54a2b0d0961957f07344e95e5',\n",
       "    'title': 'KM Approach for Improving the Labor Productivity of Vietnamese Enterprise',\n",
       "    'doi': '10.4018/jkm.2011070103'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  1.002008658507839],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s10620-006-9246-6',\n",
       "    'year': 2006,\n",
       "    'id': '8c5b2a75e5dfe1fc8c03c410ecfd2f44a05fa4a0',\n",
       "    'title': 'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass',\n",
       "    'doi': '10.1007/s10620-006-9246-6'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.994670868292451],\n",
       " [[{'doi_url': 'https://doi.org/10.3766/jaaa.21.8.6',\n",
       "    'year': 2010,\n",
       "    'id': 'd91d4584b212a2e4ab4a30a964390a9fa1094b3a',\n",
       "    'title': 'Effectiveness of the directional microphone in the Baha® Divino™.',\n",
       "    'doi': '10.3766/jaaa.21.8.6'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.989427183708176],\n",
       " [[{'doi_url': 'https://doi.org/10.2215/CJN.08640811',\n",
       "    'year': 2012,\n",
       "    'id': '2d98fecfa562e802a3aed0b4c395c8ce80fb6e5c',\n",
       "    'title': 'Renal monoclonal immunoglobulin deposition disease: a report of 64 patients from a single institution.',\n",
       "    'doi': '10.2215/CJN.08640811'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9865689937025309],\n",
       " [[{'doi_url': 'https://doi.org/10.1038/ncpgasthep0437',\n",
       "    'year': 2006,\n",
       "    'id': '4066d32ea945360ad9224eed0d3c8aa45d4900f2',\n",
       "    'title': 'Living donor liver transplantation for pediatric and adult recipients',\n",
       "    'doi': '10.1038/ncpgasthep0437'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9850273455725985],\n",
       " [[{'doi_url': 'https://doi.org/10.1038/sj.ejcn.1601965',\n",
       "    'year': 2004,\n",
       "    'id': 'ba41fce57a3f01724d255b489759d2332943c865',\n",
       "    'title': 'Validity and reproducibility of a computerised tool for assessing the iron, calcium and vitamin C intake of Belgian women',\n",
       "    'doi': '10.1038/sj.ejcn.1601965'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9841194587061183],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s10926-005-9006-z',\n",
       "    'year': 2005,\n",
       "    'id': '8fb9c95bf34a0f28dc05819cb4aada0cb94fe555',\n",
       "    'title': 'Development of Work Stress Scale for Correctional Officers',\n",
       "    'doi': '10.1007/s10926-005-9006-z'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9737479702569543],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/BF02270828',\n",
       "    'year': 2005,\n",
       "    'id': 'ed6f7f0d65f4c8bde43f13667c406ff3403f9814',\n",
       "    'title': 'Predation, seed size partitioning and the evolution of body size in seed-eating finches',\n",
       "    'doi': '10.1007/BF02270828'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9657251187600195],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s004649900359',\n",
       "    'year': 1997,\n",
       "    'id': 'd72eeacd4b5c694059ca575335e161c5beada79b',\n",
       "    'title': 'Cardiopulmonary responses to intravenous infusion of soluble and relatively insoluble gases',\n",
       "    'doi': '10.1007/s004649900359'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.965659030014649],\n",
       " [[{'doi_url': 'https://doi.org/10.1111/cdev.12340',\n",
       "    'year': 2015,\n",
       "    'id': 'f832cb5a2e43832edc0ab395c757a133e0994fae',\n",
       "    'title': 'Infants learn baby signs from video.',\n",
       "    'doi': '10.1111/cdev.12340'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9630920749856161],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/BF00284683',\n",
       "    'year': 1993,\n",
       "    'id': 'f0888ca406fc5ea91e8d0212052b781b8a930cf3',\n",
       "    'title': 'Characterization of an Aspartic Proteinase of Mucor pusillus expressed in Aspergillus oryzae',\n",
       "    'doi': '10.1007/BF00284683'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9621557335834952],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.ijcard.2009.06.058',\n",
       "    'year': 2010,\n",
       "    'id': '864ca4044d2ebf88ae4bf45df730f571039488b3',\n",
       "    'title': 'Heart rate dynamics in different levels of Zen meditation.',\n",
       "    'doi': '10.1016/j.ijcard.2009.06.058'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9591657056938859],\n",
       " [[{'doi_url': 'https://doi.org/10.1177/0306624X08323158',\n",
       "    'year': 2009,\n",
       "    'id': '193ae042e6c11bd5f19b3f24c99cfda1e7fd658b',\n",
       "    'title': 'The role of violence in street crime: a qualitative study of violent offenders.',\n",
       "    'doi': '10.1177/0306624X08323158'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9513828524854034],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/TIT.2005.860472',\n",
       "    'year': 2006,\n",
       "    'id': '7d0630dbeec4a46493496167778ed5f9410b1b0d',\n",
       "    'title': 'An algorithm for counting short cycles in bipartite graphs',\n",
       "    'doi': '10.1109/TIT.2005.860472'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9511361380573364],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s00355-005-0021-y',\n",
       "    'year': 2005,\n",
       "    'id': '9df19587849ca5cd98e43b6072aaa122efb5a29f',\n",
       "    'title': 'Poverty measurement: the critical comparison value',\n",
       "    'doi': '10.1007/s00355-005-0021-y'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.941839044727385],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/BF01906346',\n",
       "    'year': 1977,\n",
       "    'id': 'ea4d7b1168128acbd3c4f2a990fae09a7526a6d2',\n",
       "    'title': 'The instantaneous force-velocity relationship as an index of the contractile state in cardiac muscle',\n",
       "    'doi': '10.1007/BF01906346'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9329161367146298],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s10393-017-1238-9',\n",
       "    'year': 2017,\n",
       "    'id': '72f954ce63cd2a1211bba18266655ee1ea8d4615',\n",
       "    'title': 'Enteroparasitoses and Toxocarosis Affecting Children from Mar del Plata City, Argentina',\n",
       "    'doi': '10.1007/s10393-017-1238-9'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9141675797756763],\n",
       " [[{'doi_url': 'https://doi.org/10.1080/10810730.2011.604384',\n",
       "    'year': 2011,\n",
       "    'id': 'cb05521fc110b9845b8bb42afdec6c23d7f679be',\n",
       "    'title': 'Misunderstanding and potential unintended misuse of acetaminophen among adolescents and young adults.',\n",
       "    'doi': '10.1080/10810730.2011.604384'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9093358647311108],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s11104-006-9059-6',\n",
       "    'year': 2006,\n",
       "    'id': '9eb937a0eff3b0fc1b3accf6a68be6259d1a24b4',\n",
       "    'title': 'Phosphate solubilization activity of rhizobia native to Iranian soils',\n",
       "    'doi': '10.1007/s11104-006-9059-6'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.9072952883318067],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s00439-003-1056-8',\n",
       "    'year': 2003,\n",
       "    'id': '36efcd42e8fbe18e0e1baf6c2696e2971aee78b2',\n",
       "    'title': 'Apolipoprotein B-100 XbaI gene polymorphism in gallbladder cancer',\n",
       "    'doi': '10.1007/s00439-003-1056-8'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8988811540184543],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.cpcardiol.2015.11.002',\n",
       "    'year': 2016,\n",
       "    'id': 'd7a46e7c63f78c8fa2088e144ebd60bcfd73131f',\n",
       "    'title': 'Preexcitation Syndromes.',\n",
       "    'doi': '10.1016/j.cpcardiol.2015.11.002'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8969598049297929],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.forsciint.2015.12.033',\n",
       "    'year': 2016,\n",
       "    'id': 'a37913935bb44f54d54327927fc9dec2c4f68444',\n",
       "    'title': 'Determination of phenobarbital in hair matrix by liquid phase microextraction (LPME) and gas chromatography-mass spectrometry (GC-MS).',\n",
       "    'doi': '10.1016/j.forsciint.2015.12.033'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8924177154898645],\n",
       " [[{'doi_url': 'https://doi.org/10.1046/j.1525-1497.1999.00018.x',\n",
       "    'year': 1999,\n",
       "    'id': 'c4062742b4e0d13cfa0e992fdf2cebf2eb71c415',\n",
       "    'title': 'Patient preferences for colon cancer screening',\n",
       "    'doi': '10.1046/j.1525-1497.1999.00018.x'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8920758141903208],\n",
       " [[{'doi_url': 'https://doi.org/10.1089/bfm.2012.0092',\n",
       "    'year': 2013,\n",
       "    'id': '95b130dc301005b517b87ea498aa9495cc9360b0',\n",
       "    'title': 'Facial responses to basic tastes in breastfeeding and formula-feeding infants.',\n",
       "    'doi': '10.1089/bfm.2012.0092'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8780886376742274],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.acra.2010.08.024',\n",
       "    'year': 2011,\n",
       "    'id': '7bbffaf73092220bfc3cb2a0a6d34ded8d680c7d',\n",
       "    'title': 'Predictors of clinical outcome in acute pulmonary embolism: Correlation of CT pulmonary angiography with clinical, echocardiography and laboratory findings.',\n",
       "    'doi': '10.1016/j.acra.2010.08.024'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.863149801432155],\n",
       " [[{'doi_url': 'https://doi.org/10.1021/acsami.6b01557',\n",
       "    'year': 2016,\n",
       "    'id': '9aab4c51cf2efe0fa5fb92420ec205aee6546ddc',\n",
       "    'title': 'Solar Hydrogen Production Using Molecular Catalysts Immobilized on Gallium Phosphide (111)A and (111)B Polymer-Modified Photocathodes.',\n",
       "    'doi': '10.1021/acsami.6b01557'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8563292362960054],\n",
       " [[{'doi_url': 'https://doi.org/10.1137/060659211',\n",
       "    'year': 2007,\n",
       "    'id': 'c40ac08b6ebce636bca8286cbdcb3ffcba9fec85',\n",
       "    'title': 'Stability and Bifurcation Analysis of Volterra Functional Equations in the Light of Suns and Stars',\n",
       "    'doi': '10.1137/060659211'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.855267160036601],\n",
       " [[{'doi_url': 'https://doi.org/10.1038/bjc.1990.274',\n",
       "    'year': 1990,\n",
       "    'id': 'f218ce53248d756db61726985f73e6e8c109b3e2',\n",
       "    'title': 'Coffee consumption and the risk of breast cancer. A prospective study of 14,593 Norwegian women.',\n",
       "    'doi': '10.1038/bjc.1990.274'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8512859822483734],\n",
       " [[{'doi_url': 'https://doi.org/10.1093/toxsci/kfr250',\n",
       "    'year': 2011,\n",
       "    'id': '421da3edd7d840ce58b811d2ad62dac3dafc7663',\n",
       "    'title': 'Evaluation of novel high-throughput embryonic stem cell tests with new molecular markers for screening embryotoxic chemicals in vitro.',\n",
       "    'doi': '10.1093/toxsci/kfr250'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8468823470873758],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/91.784206',\n",
       "    'year': 1999,\n",
       "    'id': 'ad2927cbb1245540b8bb2c55d08e29c25cc11e76',\n",
       "    'title': 'A fuzzy k-modes algorithm for clustering categorical data',\n",
       "    'doi': '10.1109/91.784206'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8455171056790275],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.oooo.2012.02.002',\n",
       "    'year': 2012,\n",
       "    'id': 'b4253ff9f61743fab39342cb4e47b6f9b88e004c',\n",
       "    'title': 'Effect of erythrosine- and LED-mediated photodynamic therapy on buccal candidiasis infection of immunosuppressed mice and Candida albicans adherence to buccal epithelial cells.',\n",
       "    'doi': '10.1016/j.oooo.2012.02.002'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.845245483587496],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/ICASSP.2005.1416059',\n",
       "    'year': 2005,\n",
       "    'id': '27e83ae2c5473ccb6bfa25f087e2c239d62a575f',\n",
       "    'title': 'Improved modulation spectrum through multi-scale modulation frequency decomposition',\n",
       "    'doi': '10.1109/ICASSP.2005.1416059'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8394870861433446],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/BF00213601',\n",
       "    'year': 1992,\n",
       "    'id': 'b27d348dfcbf4346c6ba9e932cdffc1d7d98e5fc',\n",
       "    'title': 'Meso-diencephalic regions projecting to spinal cord and dorsal column nuclear complex in the hedgehog-tenrec, Echinops telfairi',\n",
       "    'doi': '10.1007/BF00213601'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.82864213953726],\n",
       " [[{'doi_url': 'https://doi.org/10.1093/ejcts/ezr054',\n",
       "    'year': 2012,\n",
       "    'id': 'a227eb8781e527afd5cb795ecf1de214fc7351fd',\n",
       "    'title': 'False-positivity of mediastinal lymph nodes has negative effect on survival in potentially resectable non-small cell lung cancer.',\n",
       "    'doi': '10.1093/ejcts/ezr054'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8183952887542548],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s11064-008-9733-6',\n",
       "    'year': 2008,\n",
       "    'id': 'e3a9cc9bc08fa447463d46629aa24e2c78cdd87e',\n",
       "    'title': 'Mu-Opioid Receptor in the Nucleus Submedius: Involvement in Opioid-Induced Inhibition of Mirror-Image Allodynia in a Rat Model of Neuropathic Pain',\n",
       "    'doi': '10.1007/s11064-008-9733-6'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.812637914880179],\n",
       " [[{'doi_url': 'https://doi.org/10.1146/annurev-anchem-071213-020051',\n",
       "    'year': 2015,\n",
       "    'id': '2cc15e5ffd6a3cc904be7d2f5edc11f9304582dc',\n",
       "    'title': 'Cell-Based Microarrays for In Vitro Toxicology.',\n",
       "    'doi': '10.1146/annurev-anchem-071213-020051'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.808841254399158],\n",
       " [[{'doi_url': 'https://doi.org/10.1073/pnas.1219425110',\n",
       "    'year': 2013,\n",
       "    'id': '16ebb4953469bae609d81f1dd1b879b623c15004',\n",
       "    'title': 'Evidence for maize (Zea mays) in the Late Archaic (3000-1800 B.C.) in the Norte Chico region of Peru.',\n",
       "    'doi': '10.1073/pnas.1219425110'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8072126344777645],\n",
       " [[{'doi_url': 'https://doi.org/10.3978/j.issn.2305-5839.2014.02.10',\n",
       "    'year': 2014,\n",
       "    'id': 'b87d1a177d07a8e7d66be4c9fb70ea0a03154772',\n",
       "    'title': 'Pulmonary carcinosarcoma with heterologous component: report of two cases with literature review.',\n",
       "    'doi': '10.3978/j.issn.2305-5839.2014.02.10'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.803605417185463],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s11738-009-0330-3',\n",
       "    'year': 2009,\n",
       "    'id': 'e06da9b34d6d1a7b57b27b5880c608c241adc5a2',\n",
       "    'title': 'In vitro propagation of Psoralea corylifolia L. by somatic embryogenesis in cell suspension culture',\n",
       "    'doi': '10.1007/s11738-009-0330-3'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.8027079100953415],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.acvd.2008.09.009',\n",
       "    'year': 2008,\n",
       "    'id': '0640d73669a32710123c539876393677872c7918',\n",
       "    'title': 'Quantification of mitral-valve regurgitation in a paediatric population by real-time three-dimensional echocardiography.',\n",
       "    'doi': '10.1016/j.acvd.2008.09.009'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7922009640606124],\n",
       " [[{'doi_url': 'https://doi.org/10.1177/0363546509331941',\n",
       "    'year': 2009,\n",
       "    'id': 'ba530799050f96c5ceb76eff2ba6a241df0cdf0b',\n",
       "    'title': 'Replication of the range of native anterior cruciate ligament fiber length change behavior achieved by different grafts: measurement using computer-assisted navigation.',\n",
       "    'doi': '10.1177/0363546509331941'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7862058009253815],\n",
       " [[{'doi_url': 'https://doi.org/10.3390/rs8110927',\n",
       "    'year': 2016,\n",
       "    'id': '0fbe46932967ec0db80b18e70fa199fb652313ea',\n",
       "    'title': 'Regionalization of Uncovered Agricultural Soils Based on Organic Carbon and Soil Texture Estimations',\n",
       "    'doi': '10.3390/rs8110927'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7783485742285848],\n",
       " [[{'doi_url': 'https://doi.org/10.1172/JCI89281',\n",
       "    'year': 2017,\n",
       "    'id': '1f208e6cba1570030c11bedc0fa0465b613ec0f7',\n",
       "    'title': 'Membrane-organizing protein moesin controls Treg differentiation and antitumor immunity via TGF-β signaling.',\n",
       "    'doi': '10.1172/JCI89281'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7775574384722855],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.mcm.2007.06.029',\n",
       "    'year': 2008,\n",
       "    'id': '6f06076133abe3cd3bfed4d2f20c3fd97eef3702',\n",
       "    'title': \"A fuzzy nonlinear model for quality function deployment considering Kano's concept\",\n",
       "    'doi': '10.1016/j.mcm.2007.06.029'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7774255139054733],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s00381-009-0954-z',\n",
       "    'year': 2009,\n",
       "    'id': '0b4af9555c95dd8f64bcf45de86c7f380f3eac73',\n",
       "    'title': 'Pott’s puffy tumor in children',\n",
       "    'doi': '10.1007/s00381-009-0954-z'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7662392771337182],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/BF02818614',\n",
       "    'year': 1998,\n",
       "    'id': 'b1b12644378d1e61f298e247ad936f0a16bb9989',\n",
       "    'title': 'Cytotoxic necrotizing factor 1 fromEscherichia coli: a toxin with a new intracellular activity for eukaryotic cells',\n",
       "    'doi': '10.1007/BF02818614'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7644681830657647],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s00432-009-0572-x',\n",
       "    'year': 2009,\n",
       "    'id': '5cfdb256b6ae968374469bd36702ed341cfe9485',\n",
       "    'title': 'A joint detection of CEA and CA-50 levels in saliva and serum of patients with tumors in oral region and salivary gland',\n",
       "    'doi': '10.1007/s00432-009-0572-x'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7399670760147273],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.cell.2009.08.047',\n",
       "    'year': 2009,\n",
       "    'id': '9d82517bef50ee79c57609834eb165961e33d4f7',\n",
       "    'title': 'Regulation of MBK-2/DYRK by CDK-1 and the Pseudophosphatases EGG-4 and EGG-5 during the Oocyte-to-Embryo Transition',\n",
       "    'doi': '10.1016/j.cell.2009.08.047'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7375554257771001],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s002470050350',\n",
       "    'year': 1998,\n",
       "    'id': '3bfb9955d7fb268294ec392aa6465a0ef95dce7e',\n",
       "    'title': 'MR imaging of a pilomatrixoma',\n",
       "    'doi': '10.1007/s002470050350'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7365450655343009],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/TSMCC.2005.848191',\n",
       "    'year': 2005,\n",
       "    'id': '02fc5fada3a31fc2b128b4784fd2e8c8a75b8b08',\n",
       "    'title': 'An adaptive multimodal biometric management algorithm',\n",
       "    'doi': '10.1109/TSMCC.2005.848191'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7281454955227674],\n",
       " [[{'doi_url': 'https://doi.org/10.1016/j.biotechadv.2009.04.011',\n",
       "    'year': 2009,\n",
       "    'id': '04547565eae033cbd9826ca4e31b8cf00e2b2400',\n",
       "    'title': 'Biomass-oxygen gasification in a high-temperature entrained-flow gasifier.',\n",
       "    'doi': '10.1016/j.biotechadv.2009.04.011'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7227886985288934],\n",
       " [[{'doi_url': 'https://doi.org/10.1073/pnas.1403814111',\n",
       "    'year': 2014,\n",
       "    'id': 'f9b4d45b0b6135dfecab5aa950b11f7b17267e91',\n",
       "    'title': 'DICER1/Alu RNA dysmetabolism induces Caspase-8-mediated cell death in age-related macular degeneration.',\n",
       "    'doi': '10.1073/pnas.1403814111'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7090221536112952],\n",
       " [[{'doi_url': 'https://doi.org/10.1007/s00395-014-0446-5',\n",
       "    'year': 2014,\n",
       "    'id': '11781ea072a749847253639a9903e8b796d51e54',\n",
       "    'title': 'Complex Brugada syndrome inheritance in a family harbouring compound SCN5A and CACNA1C mutations',\n",
       "    'doi': '10.1007/s00395-014-0446-5'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.7010616733925418],\n",
       " [[{'doi_url': 'https://doi.org/10.1023/A:1016097312036',\n",
       "    'year': 2002,\n",
       "    'id': 'a05b1e526645868d6f664a81a7fb7205ffc147e4',\n",
       "    'title': 'Leaf discs floated on water are different from intact leaves in photosynthesis and photoinhibition',\n",
       "    'doi': '10.1023/A:1016097312036'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.6973325479542839],\n",
       " [[{'doi_url': 'https://doi.org/10.1109/ICASSP.2006.1660679',\n",
       "    'year': 2006,\n",
       "    'id': '3dffad910b096a2065f292ace889567ba219d40a',\n",
       "    'title': 'The Multiple-Parameter Discrete Fractional Fourier Transform and Its Application',\n",
       "    'doi': '10.1109/ICASSP.2006.1660679'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.6971417890861631],\n",
       " [[{'doi_url': 'https://doi.org/10.3233/IKS-2012-0197',\n",
       "    'year': 2011,\n",
       "    'id': '0728b111bd17fda94b4861e79689edc01e492226',\n",
       "    'title': 'Causal inference and heterogeneity bias in social science',\n",
       "    'doi': '10.3233/IKS-2012-0197'},\n",
       "   {},\n",
       "   {'name': 'databases', 'fake': True}],\n",
       "  0.649416531692259]]"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "CALL algo.pageRank.stream(\n",
    "    'MATCH (c:ResearchCommunity {name: \"databases\"})<-[:RELEVANT_TO]-(publication)<-[:OF]-(instance)<-[:PUBLISHED_IN]-(article:Article) WHERE (instance:Volume OR instance:Edition) AND (publication:Journal OR publication:Conference) RETURN article',\n",
    "    'CITED_BY', {iterations:20, dampingFactor:0.85})\n",
    "YIELD nodeId, score\n",
    "MATCH (a:Article) WHERE ID(a) = nodeId\n",
    "WITH a, score\n",
    "ORDER by score DESC\n",
    "WITH a, score LIMIT 100\n",
    "MATCH (rc:ResearchCommunity {name: \"databases\"})\n",
    "MERGE p=(a)-[:RECOMMENDED_TO]->(rc)\n",
    "RETURN p, score;"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Finally, an author of any of these top-100 papers is automatically considered a potential\n",
    "good match to review database papers. In addition, we want to identify gurus, i.e.,\n",
    "very reputated authors that would be able to review for top conferences. We identify\n",
    "gurus as those authors that are authors of, at least, two papers among the top-100\n",
    "identified.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "All the papers recommended to the research community are those in the top 100 of the PageRank algorithm. Who are the authors of these articles?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>author</th>\n",
       "        <th>article</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>P. M. Boland</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>S. D. Goldstein</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>D. M. Kastenberg</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>B. J. O’Hara</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>R. S. Dhillon</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['P. M. Boland',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass'],\n",
       " ['S. D. Goldstein',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass'],\n",
       " ['D. M. Kastenberg',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass'],\n",
       " ['B. J. O’Hara',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass'],\n",
       " ['R. S. Dhillon',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass']]"
      ]
     },
     "execution_count": 114,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (a:Author)-[:AUTHORS]->(b:Article)-[:RECOMMENDED_TO]->(rc:ResearchCommunity {name: 'databases'})\n",
    "RETURN a.name as author, b.title as article\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Assign these authors to the research community, as potential reviewers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "491 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 115,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (a:Author)-[:AUTHORS]->(b:Article)-[:RECOMMENDED_TO]->(rc:ResearchCommunity {name: 'databases'})\n",
    "WITH a, rc\n",
    "MERGE (a)-[:REVIEWER_CANDIDATE]->(rc)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, check how many articles these authors authored"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>a.name</th>\n",
       "        <th>b.title</th>\n",
       "        <th>n_articles</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>S. D. Goldstein</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>D. M. Kastenberg</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>B. J. O’Hara</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>R. S. Dhillon</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>P. M. Boland</td>\n",
       "        <td>Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['S. D. Goldstein',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass',\n",
       "  1],\n",
       " ['D. M. Kastenberg',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass',\n",
       "  1],\n",
       " ['B. J. O’Hara',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass',\n",
       "  1],\n",
       " ['R. S. Dhillon',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass',\n",
       "  1],\n",
       " ['P. M. Boland',\n",
       "  'Adenocarcinoma of the Prostate Presenting as an Obstructing Rectal Mass',\n",
       "  1]]"
      ]
     },
     "execution_count": 118,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (a:Author)-[:AUTHORS]->(b:Article)-[:RECOMMENDED_TO]->(rc:ResearchCommunity {name: 'databases'})\n",
    "RETURN a.name, b.title, count(b) as n_articles\n",
    "ORDER BY n_articles DESC\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 120,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (a:Author)-[:AUTHORS]->(b:Article)-[:RECOMMENDED_TO]->(rc:ResearchCommunity {name: 'databases'})\n",
    "WITH a, count(b) as n_articles, rc\n",
    "WHERE n_articles >= 2\n",
    "MERGE (a)-[:GURU_OF]->(rc)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "It seems there are no gurus, since no one has authored more than 2 articles"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.4 64-bit ('od': venv)",
   "language": "python",
   "name": "python37464bitodvenv509b99c2ab9d45c0933875aa4d9677e6"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
